{"target":{"meta":{"_id":"5e7f9fbf54b3140012bcf4b5","createdAt":1585422271272,"updatedAt":1587392966126,"user":{"_id":"5e491caf40167a00115a8c86"},"author":{"meta":{"email":"kristina@hugzie.xyz","title":"Kristina Grlić","slug":"kristina-grli","description":"This is a description for Kristina Grlić.","coverImageUri":"/media/authors/kristina-grlic.jpg"},"content":[]},"draft":false,"title":"The History of Stickers","slug":"the-history-of-stickers","description":"Let's look at when, how and why were stickers first created. ","coverImageUri":"/media/blogs/the-history-of-stickers/close-up-photography-of-bicycle-near-wall-2909097.jpg"},"content":[{"type":"HEADING_1","value":"## The First Stickers\n\n"},{"type":"PARAGRAPH","value":"As we strive to carve out our identity and sense of self, we search for means and ways of expressing our individuality, be it through art, music, writing, or something else. Throughout recent years a seemingly new and interesting way of expressing individuality emerged — stickers. However, one might be surprised to find out that stickers have been around for much longer, though not in the form we recognize today. \n\n"},{"type":"PARAGRAPH","value":"Depending on what people consider to be a sticker, you can find three general answers to the question when did stickers first emerge.\nSome say that stickers began their story in the times of Ancient Egypt, where people glued papers with names and prices of their products on the walls of their markets. It was an easy and fast way to give the customers the most wanted information. However, this raises the question if these can be considered as the first stickers; after all, they were more like posters than stickers. \n\n"},{"type":"PARAGRAPH","value":"Another theory suggests that the first stickers made their appearance in the form of postage stamps, created by Sir Rowland Hill in the mid 1800's. However, stamps are also a little bit different than our modern stickers. They are not self-adhesive by themselves. You had to wet them so that you could glue them to the envelope.\n\n"},{"type":"WIDGET","name":"figure","value":{"number":1,"name":"Figure","description":"Post Stamp","uri":"/media/blogs/the-history-of-stickers/post-stamp.jpg"}},{"type":"PARAGRAPH","value":"And finally, you could say that our modern-day sticker was firstly created by Ray Stanton Avery in 1935, when he invented the first self-adhesive label. He was the founder of \"Avery Adhesives\". But soon he merged with another company called Dennison Manufacturing, to create Avery Dennison, a company that still exists. They produce labels for all sorts of various merchandise objects, among all other things. It could be said that this was the real emergence of stickers.\n\n"},{"type":"HEADING_2","value":"### How were the first stickers created? \n\n"},{"type":"PARAGRAPH","value":"The aforementioned theory of the emergence of the modern-day sticker seems to be the most plausible one, and the one we have the most proof for. Therefore, let’s look into how \"Avery Dennison\" made their first stickers.\nIt is very interesting how these modern-day machines managed to evolve from a thing that was created by  R. S. Avery back in the 1900's. His first self-adhesive or pressure sensitive die-cut machine was created by combining used machine parts with a saber saw. Of course, he patented the invention and today it is known as the world's first self-adhesive (also called pressure sensitive) die-cut labeling machine. The first stickers that he created were simple circle labels, which were quite nifty because they were easily peeled off without leaving a mark on the product.\n\n"},{"type":"HEADING_2","value":"### Why were Stickers Even Created?\n\n"},{"type":"PARAGRAPH","value":"As mentioned above, first stickers were used to give certain information about a specific product. Avery's first round stickers were created so that the producers could label prices of their products, and since they didn't leave any marks, they were perfect for this. Soon Avery realized that these labels can present more information than just prices. They started creating product labels for different producers. Since they were a great way to present information about a certain product, people started using them more and more for advertising their merchandise. \n\n"},{"type":"WIDGET","name":"figure","value":{"number":2,"name":"Figure","description":"Vintage Bottles","uri":"/media/blogs/the-history-of-stickers/vintage-bottles.jpg"}},{"type":"PARAGRAPH","value":"Besides this, stickers were also used for political purposes, like advertising campaigns. In the 1900's, you could see cars and mailboxes covered with \"I Voted\" stickers. And they're popular even today. America is the most well-known country that practices this type of political expression. \n\n"},{"type":"WIDGET","name":"figure","value":{"number":3,"name":"Figure","description":"I Voted Sticker","uri":"/media/blogs/the-history-of-stickers/vote-sticker.jpg"}},{"type":"PARAGRAPH","value":"Then people realized that stickers were a great way of expressing their thoughts and attitudes and started producing some of them for those purposes only. Just think about it, with a single sticker you can state anything. And that's how we ended up with all these different kinds of fun and creative stickers. What is even more interesting, they are still used for all the things mentioned above, and with the rise of planners and bullet journals people seem to find different ways for using them every day. \n\n"},{"type":"HEADING_1","value":"## Stickers Today\n\n"},{"type":"PARAGRAPH","value":"Nowadays, you can find various kinds of stickers. They come in many different shapes, sizes and designs. They can be printed on different types of paper. Their method of gluing can be different; they can be self-adhesive, their glue can be triggered by water or heat and so on. The production of stickers is also different depending on where you want to stick them. There are companies that manufacture wall stickers, car stickers or notebook stickers.  \n\n"},{"type":"WIDGET","name":"figure","value":{"number":4,"name":"Figure","description":"Window Stickers","uri":"/media/blogs/the-history-of-stickers/window-sticker.jpg"}},{"type":"PARAGRAPH","value":"In my opinion, the leading role of stickers is still labeling products. However, even long before bullet journals got so popular, kids used to play with stickers all the time, covering their notebooks or toys. They're just really fun to play around with. But as mentioned above, with the invention of bullet journals, the production of stickers skyrocketed. People realized that stickers were an easy way of decorating their notes and keeping them more organized. Still, people seem to find different uses for stickers everyday. That's what's so fun about them. You can use them however you want, to decorate, to express yourself, to cover your mistakes, literally anything that comes to your mind.\n\n"},{"type":"WIDGET","name":"figure","value":{"number":5,"name":"Figure","description":"Laptop covered in stickers","uri":"/media/blogs/the-history-of-stickers/laptop.jpg"}},{"type":"PARAGRAPH","value":"Today you can find many online stores where you can find different kinds of stickers. There are even some platforms where many artists can create their own profiles and sell their designs in the form of stickers, like Redbubble or Society6. \n If you’re still not quite sure that you can express yourself with only one sticker, try finding one in my store or on these two platforms. I guarantee you that you’ll find something that suits you just right. \n\n"},{"type":"PARAGRAPH","value":"Make sure to check out originally designed stickers at this link and don’t forget to have fun and stay creative!  \n\n"}]},"related":[{"title":"What are Die Cut Stickers?","description":"By reading this post you will find some basic information about die cut stickers, like how they are made and their creative use. ","coverImageUri":"/media/blogs/what-are-die-cut-stickers/cover.jpg","slug":"what-are-die-cut-stickers"},{"title":"What are Die Cut Stickers?","description":"By reading this post you will find some basic information about die cut stickers, like how they are made and their creative use. ","coverImageUri":"/media/stickers/witchs-brew/witchs-brew.png","slug":"witchs-brew"},{"title":"Top 5 Online Sticker Stores","description":"If you were wondering where to find the perfect stickers, here is our top five online sticker stores. ","coverImageUri":"/media/stickers/cute-cactus/cute-cactus.png","slug":"cute-cactus"}]}